v2206/Projects/airfoil/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    west
    {
        type            patch;
        nFaces          34;
        startFace       32358;
    }
    east
    {
        type            patch;
        nFaces          86;
        startFace       32392;
    }
    north
    {
        type            patch;
        nFaces          24;
        startFace       32478;
    }
    south
    {
        type            patch;
        nFaces          24;
        startFace       32502;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          16141;
        startFace       32526;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          16141;
        startFace       48667;
    }
    airfoil
    {
        type            wall;
        inGroups        1(wall);
        nFaces          368;
        startFace       64808;
    }
)

// ************************************************************************* //
