v2206/Projects/airfoil/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 102.0621;

boundaryField
{
    airfoil
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    west
    {
        type            fixedValue;
        value           $internalField;
    }
    east
    {
	type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    north
    {
	type		slip;
    }
    south
    {
	type		slip;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}
// ************************************************************************* //
